bhoot1234567890/gba-embedded/platform/esp32s3/sdkconfig.defaults
# QEMU test config — no PSRAM (QEMU doesn't emulate it)
CONFIG_CXX_EXCEPTIONS=y
CONFIG_CXX_EXCEPTIONS_EMULATION_POOL_SIZE=64
CONFIG_CXX_RTTI=y
CONFIG_IDF_TARGET="esp32s3"
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_LOG_DEFAULT_LEVEL_INFO=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=32768
# CONFIG_SPIRAM is not set
